[
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "Which Azure RBAC role allows a user to view all resources but not make any changes?",
      "es": "¿Qué rol de RBAC de Azure permite a un usuario ver todos los recursos pero no realizar cambios?"
    },
    "explanation": {
      "en": "The Reader role provides read-only access to all resources without modification permissions.",
      "es": "El rol Reader proporciona acceso de solo lectura a todos los recursos sin permisos de modificación."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Reader",
          "es": "Lector"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Contributor",
          "es": "Colaborador"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Owner",
          "es": "Propietario"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "User Access Administrator",
          "es": "Administrador de acceso de usuario"
        },
        "isCorrect": false
      }
    ],
    "tags": ["rbac", "roles", "permissions"]
  },
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to grant a developer the ability to create and manage virtual machines in a specific resource group, but not delete them. What should you do?",
      "es": "Necesita otorgar a un desarrollador la capacidad de crear y administrar máquinas virtuales en un grupo de recursos específico, pero no eliminarlas. ¿Qué debe hacer?"
    },
    "explanation": {
      "en": "A custom role allows you to define specific permissions, including allowing VM creation and management while denying delete operations at the resource group scope.",
      "es": "Un rol personalizado le permite definir permisos específicos, incluyendo permitir la creación y administración de VM mientras se deniegan las operaciones de eliminación en el ámbito del grupo de recursos."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Assign the Virtual Machine Contributor role at the resource group scope",
          "es": "Asignar el rol Colaborador de máquina virtual en el ámbito del grupo de recursos"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "Create a custom role with Microsoft.Compute/virtualMachines/* permissions and deny Microsoft.Compute/virtualMachines/delete",
          "es": "Crear un rol personalizado con permisos Microsoft.Compute/virtualMachines/* y denegar Microsoft.Compute/virtualMachines/delete"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Assign the Contributor role at subscription level",
          "es": "Asignar el rol Colaborador a nivel de suscripción"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Use Azure Policy to prevent VM deletion",
          "es": "Usar Azure Policy para evitar la eliminación de VM"
        },
        "isCorrect": false
      }
    ],
    "tags": ["rbac", "custom-roles", "resource-group"]
  },
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "HARD",
    "qtype": "MULTI",
    "stem": {
      "en": "Your company has multiple Azure subscriptions. You need to implement a governance solution that ensures all resources have mandatory tags for cost tracking. Which THREE actions should you perform?",
      "es": "Su empresa tiene varias suscripciones de Azure. Necesita implementar una solución de gobernanza que garantice que todos los recursos tengan etiquetas obligatorias para el seguimiento de costos. ¿Qué TRES acciones debe realizar?"
    },
    "explanation": {
      "en": "Azure Policy with 'Require a tag' effect enforces tagging, remediation tasks apply policies to existing resources, and management group scope ensures consistent application across subscriptions.",
      "es": "Azure Policy con el efecto 'Requerir una etiqueta' aplica el etiquetado, las tareas de corrección aplican políticas a los recursos existentes, y el ámbito del grupo de administración garantiza una aplicación coherente en las suscripciones."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Create an Azure Policy definition with 'Require a tag and its value' effect",
          "es": "Crear una definición de Azure Policy con el efecto 'Requerir una etiqueta y su valor'"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Assign the policy at the management group level",
          "es": "Asignar la política a nivel del grupo de administración"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Create a resource lock on each subscription",
          "es": "Crear un bloqueo de recursos en cada suscripción"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Create a remediation task to tag existing resources",
          "es": "Crear una tarea de corrección para etiquetar los recursos existentes"
        },
        "isCorrect": true
      },
      {
        "label": "E",
        "text": {
          "en": "Configure Azure Monitor alerts for untagged resources",
          "es": "Configurar alertas de Azure Monitor para recursos sin etiquetas"
        },
        "isCorrect": false
      }
    ],
    "tags": ["azure-policy", "tags", "governance", "management-groups"]
  },
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You have created a management group hierarchy. Where should you apply an Azure Policy to ensure it affects all subscriptions in your organization?",
      "es": "Ha creado una jerarquía de grupos de administración. ¿Dónde debe aplicar una Azure Policy para asegurarse de que afecte a todas las suscripciones de su organización?"
    },
    "explanation": {
      "en": "Applying policies at the root management group ensures they inherit down to all child management groups and subscriptions.",
      "es": "Aplicar políticas en el grupo de administración raíz garantiza que se hereden a todos los grupos de administración secundarios y suscripciones."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "At the root management group",
          "es": "En el grupo de administración raíz"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "At each subscription individually",
          "es": "En cada suscripción individualmente"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "At the resource group level",
          "es": "A nivel de grupo de recursos"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "At the billing account level",
          "es": "A nivel de cuenta de facturación"
        },
        "isCorrect": false
      }
    ],
    "tags": ["management-groups", "policy", "inheritance"]
  },
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "What type of resource lock prevents accidental deletion but still allows modifications to a resource?",
      "es": "¿Qué tipo de bloqueo de recursos evita la eliminación accidental pero aún permite modificaciones en un recurso?"
    },
    "explanation": {
      "en": "CanNotDelete lock allows all operations except deletion. ReadOnly lock prevents both deletion and modification.",
      "es": "El bloqueo CanNotDelete permite todas las operaciones excepto la eliminación. El bloqueo ReadOnly evita tanto la eliminación como la modificación."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "CanNotDelete",
          "es": "CanNotDelete"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "ReadOnly",
          "es": "ReadOnly"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "DoNotModify",
          "es": "DoNotModify"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "PreventDelete",
          "es": "PreventDelete"
        },
        "isCorrect": false
      }
    ],
    "tags": ["resource-locks", "protection"]
  },
  {
    "domain": "IDENTITY_GOVERNANCE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "Your organization requires that users must provide two forms of authentication when accessing Azure resources. Which feature should you enable?",
      "es": "Su organización requiere que los usuarios proporcionen dos formas de autenticación al acceder a los recursos de Azure. ¿Qué característica debe habilitar?"
    },
    "explanation": {
      "en": "Azure Multi-Factor Authentication (MFA) requires users to verify their identity using two or more verification methods.",
      "es": "Azure Multi-Factor Authentication (MFA) requiere que los usuarios verifiquen su identidad utilizando dos o más métodos de verificación."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Azure Multi-Factor Authentication (MFA)",
          "es": "Azure Multi-Factor Authentication (MFA)"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Conditional Access policies only",
          "es": "Solo políticas de acceso condicional"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Password complexity requirements",
          "es": "Requisitos de complejidad de contraseña"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Azure AD Identity Protection",
          "es": "Azure AD Identity Protection"
        },
        "isCorrect": false
      }
    ],
    "tags": ["entra-id", "mfa", "authentication"]
  },
  {
    "domain": "COMPUTE",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "Which Azure VM size series is optimized for memory-intensive workloads such as databases?",
      "es": "¿Qué serie de tamaños de VM de Azure está optimizada para cargas de trabajo intensivas en memoria como bases de datos?"
    },
    "explanation": {
      "en": "The E-series VMs are memory-optimized with high memory-to-core ratios, ideal for databases and caching.",
      "es": "Las VM de serie E están optimizadas para memoria con altas proporciones de memoria por núcleo, ideales para bases de datos y almacenamiento en caché."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "D-series (General purpose)",
          "es": "Serie D (Propósito general)"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "E-series (Memory optimized)",
          "es": "Serie E (Optimizada para memoria)"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "F-series (Compute optimized)",
          "es": "Serie F (Optimizada para cómputo)"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "B-series (Burstable)",
          "es": "Serie B (Ráfaga)"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vm", "sizing", "compute"]
  },
  {
    "domain": "COMPUTE",
    "difficulty": "MEDIUM",
    "qtype": "MULTI",
    "stem": {
      "en": "You need to ensure high availability for a critical application running on Azure VMs. Which TWO configurations should you implement?",
      "es": "Necesita garantizar alta disponibilidad para una aplicación crítica que se ejecuta en VM de Azure. ¿Qué DOS configuraciones debe implementar?"
    },
    "explanation": {
      "en": "Availability Zones provide datacenter-level redundancy, and Availability Sets provide rack-level redundancy within a datacenter. Both improve availability.",
      "es": "Las Zonas de disponibilidad proporcionan redundancia a nivel de centro de datos, y los Conjuntos de disponibilidad proporcionan redundancia a nivel de rack dentro de un centro de datos. Ambos mejoran la disponibilidad."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Deploy VMs across multiple Availability Zones",
          "es": "Implementar VM en varias Zonas de disponibilidad"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Use Premium SSD Managed Disks",
          "es": "Usar Discos administrados SSD Premium"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Configure an Availability Set with fault domains and update domains",
          "es": "Configurar un Conjunto de disponibilidad con dominios de error y dominios de actualización"
        },
        "isCorrect": true
      },
      {
        "label": "D",
        "text": {
          "en": "Enable VM auto-shutdown",
          "es": "Habilitar apagado automático de VM"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vm", "availability", "high-availability"]
  },
  {
    "domain": "COMPUTE",
    "difficulty": "HARD",
    "qtype": "SINGLE",
    "stem": {
      "en": "You have a VM Scale Set configured to scale based on CPU usage. The application experiences sudden traffic spikes. What should you configure to handle rapid scaling more effectively?",
      "es": "Tiene un conjunto de escalado de VM configurado para escalar según el uso de CPU. La aplicación experimenta picos de tráfico repentinos. ¿Qué debe configurar para manejar el escalado rápido de manera más efectiva?"
    },
    "explanation": {
      "en": "Decreasing the scale-out cooldown period allows the scale set to add instances more quickly in response to metrics. Default cooldown can delay rapid scaling.",
      "es": "Disminuir el período de enfriamiento de escalado horizontal permite que el conjunto de escalado agregue instancias más rápidamente en respuesta a las métricas. El enfriamiento predeterminado puede retrasar el escalado rápido."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Increase the minimum instance count",
          "es": "Aumentar el recuento mínimo de instancias"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "Decrease the scale-out cooldown period",
          "es": "Disminuir el período de enfriamiento de escalado horizontal"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Change the scaling metric to memory usage",
          "es": "Cambiar la métrica de escalado al uso de memoria"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Enable automatic OS upgrades",
          "es": "Habilitar actualizaciones automáticas del sistema operativo"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vmss", "autoscaling", "performance"]
  },
  {
    "domain": "COMPUTE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to resize a running VM to a larger size. What must be true for the resize operation to complete without deallocating the VM?",
      "es": "Necesita cambiar el tamaño de una VM en ejecución a un tamaño mayor. ¿Qué debe ser cierto para que la operación de cambio de tamaño se complete sin desasignar la VM?"
    },
    "explanation": {
      "en": "The new VM size must be available in the current hardware cluster. If not available, the VM must be deallocated and reallocated to a different cluster.",
      "es": "El nuevo tamaño de VM debe estar disponible en el clúster de hardware actual. Si no está disponible, la VM debe desasignarse y reasignarse a un clúster diferente."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "The new size must be available in the current hardware cluster",
          "es": "El nuevo tamaño debe estar disponible en el clúster de hardware actual"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "The VM must be in a stopped state",
          "es": "La VM debe estar en estado detenido"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "The VM must use unmanaged disks",
          "es": "La VM debe usar discos no administrados"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "The VM must be in an Availability Set",
          "es": "La VM debe estar en un Conjunto de disponibilidad"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vm", "resize", "operations"]
  },
  {
    "domain": "NETWORKING",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "What is the maximum number of virtual network peerings allowed per VNet?",
      "es": "¿Cuál es el número máximo de emparejamientos de red virtual permitidos por VNet?"
    },
    "explanation": {
      "en": "Azure supports up to 500 VNet peerings per virtual network, allowing large hub-and-spoke architectures.",
      "es": "Azure admite hasta 500 emparejamientos de VNet por red virtual, lo que permite arquitecturas hub-and-spoke grandes."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "50",
          "es": "50"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "100",
          "es": "100"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "500",
          "es": "500"
        },
        "isCorrect": true
      },
      {
        "label": "D",
        "text": {
          "en": "Unlimited",
          "es": "Ilimitado"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vnet", "peering", "limits"]
  },
  {
    "domain": "NETWORKING",
    "difficulty": "MEDIUM",
    "qtype": "MULTI",
    "stem": {
      "en": "You need to restrict inbound RDP access to a VM only from your corporate network (IP 203.0.113.0/24). Which TWO actions should you perform?",
      "es": "Necesita restringir el acceso RDP entrante a una VM solo desde su red corporativa (IP 203.0.113.0/24). ¿Qué DOS acciones debe realizar?"
    },
    "explanation": {
      "en": "An NSG inbound rule allows RDP (port 3389) from the specified source IP range, and associating it with the VM's NIC or subnet enforces the rule.",
      "es": "Una regla de entrada NSG permite RDP (puerto 3389) desde el rango de IP de origen especificado, y asociarla con la NIC o subred de la VM aplica la regla."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Create an NSG inbound security rule allowing port 3389 from source 203.0.113.0/24",
          "es": "Crear una regla de seguridad de entrada NSG que permita el puerto 3389 desde el origen 203.0.113.0/24"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Associate the NSG with the VM's network interface or subnet",
          "es": "Asociar el NSG con la interfaz de red o subred de la VM"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Configure Azure Firewall to filter RDP traffic",
          "es": "Configurar Azure Firewall para filtrar el tráfico RDP"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Enable Just-in-Time VM access",
          "es": "Habilitar acceso JIT a la VM"
        },
        "isCorrect": false
      }
    ],
    "tags": ["nsg", "security", "rdp"]
  },
  {
    "domain": "NETWORKING",
    "difficulty": "HARD",
    "qtype": "SINGLE",
    "stem": {
      "en": "You have two VNets connected via VNet peering. VMs in VNet1 cannot access VMs in VNet2 despite the peering being in 'Connected' state. What is the most likely cause?",
      "es": "Tiene dos VNet conectadas mediante emparejamiento de VNet. Las VM en VNet1 no pueden acceder a las VM en VNet2 a pesar de que el emparejamiento está en estado 'Conectado'. ¿Cuál es la causa más probable?"
    },
    "explanation": {
      "en": "Even with VNet peering established, NSG rules on the destination subnet or NIC can block traffic between peered networks.",
      "es": "Incluso con el emparejamiento de VNet establecido, las reglas NSG en la subred o NIC de destino pueden bloquear el tráfico entre redes emparejadas."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "VNet peering is one-way and needs to be configured bidirectionally",
          "es": "El emparejamiento de VNet es unidireccional y debe configurarse bidireccionalmente"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "Network Security Groups are blocking the traffic",
          "es": "Los Grupos de seguridad de red están bloqueando el tráfico"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "The VNets are in different Azure regions",
          "es": "Las VNet están en diferentes regiones de Azure"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "VNet peering requires a VPN gateway",
          "es": "El emparejamiento de VNet requiere una puerta de enlace VPN"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vnet-peering", "troubleshooting", "nsg"]
  },
  {
    "domain": "NETWORKING",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to route all internet-bound traffic from VMs through a network virtual appliance (NVA). What should you configure?",
      "es": "Necesita enrutar todo el tráfico con destino a Internet desde las VM a través de un dispositivo virtual de red (NVA). ¿Qué debe configurar?"
    },
    "explanation": {
      "en": "User Defined Routes (UDR) override Azure's default routing and allow you to force traffic through an NVA by specifying the next hop.",
      "es": "Las Rutas Definidas por el Usuario (UDR) anulan el enrutamiento predeterminado de Azure y permiten forzar el tráfico a través de un NVA especificando el siguiente salto."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "User Defined Route (UDR) with next hop type Virtual Appliance",
          "es": "Ruta Definida por el Usuario (UDR) con tipo de siguiente salto Dispositivo virtual"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Network Security Group with outbound rules",
          "es": "Grupo de Seguridad de Red con reglas de salida"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Azure Firewall policy",
          "es": "Política de Azure Firewall"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Service endpoint for the subnet",
          "es": "Punto de conexión de servicio para la subred"
        },
        "isCorrect": false
      }
    ],
    "tags": ["udr", "routing", "nva"]
  },
  {
    "domain": "NETWORKING",
    "difficulty": "EASY",
    "qtype": "YESNO",
    "stem": {
      "en": "Can you connect two VNets in different Azure regions using VNet peering?",
      "es": "¿Puede conectar dos VNet en diferentes regiones de Azure usando emparejamiento de VNet?"
    },
    "explanation": {
      "en": "Yes, Global VNet Peering allows you to peer VNets across different Azure regions.",
      "es": "Sí, el Emparejamiento Global de VNet le permite emparejar VNet en diferentes regiones de Azure."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Yes",
          "es": "Sí"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "No",
          "es": "No"
        },
        "isCorrect": false
      }
    ],
    "tags": ["vnet-peering", "global-peering", "regions"]
  },
  {
    "domain": "STORAGE",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "Which Azure storage redundancy option provides the highest durability with copies in multiple geographic regions?",
      "es": "¿Qué opción de redundancia de almacenamiento de Azure proporciona la mayor durabilidad con copias en varias regiones geográficas?"
    },
    "explanation": {
      "en": "Geo-Zone-Redundant Storage (GZRS) combines ZRS in the primary region with replication to a secondary geographic region, providing the highest durability.",
      "es": "El almacenamiento con redundancia de zona geográfica (GZRS) combina ZRS en la región primaria con replicación a una región geográfica secundaria, proporcionando la mayor durabilidad."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Locally Redundant Storage (LRS)",
          "es": "Almacenamiento con redundancia local (LRS)"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "Zone-Redundant Storage (ZRS)",
          "es": "Almacenamiento con redundancia de zona (ZRS)"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Geo-Redundant Storage (GRS)",
          "es": "Almacenamiento con redundancia geográfica (GRS)"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Geo-Zone-Redundant Storage (GZRS)",
          "es": "Almacenamiento con redundancia de zona geográfica (GZRS)"
        },
        "isCorrect": true
      }
    ],
    "tags": ["storage", "redundancy", "durability"]
  },
  {
    "domain": "STORAGE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to provide temporary access to a blob for an external partner without sharing your storage account key. What should you use?",
      "es": "Necesita proporcionar acceso temporal a un blob para un socio externo sin compartir su clave de cuenta de almacenamiento. ¿Qué debe usar?"
    },
    "explanation": {
      "en": "Shared Access Signature (SAS) provides secure, time-limited access to storage resources without exposing account keys.",
      "es": "La firma de acceso compartido (SAS) proporciona acceso seguro y limitado en el tiempo a los recursos de almacenamiento sin exponer las claves de cuenta."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Azure AD authentication",
          "es": "Autenticación de Azure AD"
        },
        "isCorrect": false
      },
      {
        "label": "B",
        "text": {
          "en": "Shared Access Signature (SAS)",
          "es": "Firma de acceso compartido (SAS)"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Storage account access key",
          "es": "Clave de acceso de cuenta de almacenamiento"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Managed Identity",
          "es": "Identidad administrada"
        },
        "isCorrect": false
      }
    ],
    "tags": ["storage", "sas", "security"]
  },
  {
    "domain": "STORAGE",
    "difficulty": "HARD",
    "qtype": "MULTI",
    "stem": {
      "en": "You need to optimize costs for blob storage containing log files that are frequently accessed for 30 days, occasionally for 90 days, and rarely after that. Which THREE lifecycle management actions should you configure?",
      "es": "Necesita optimizar costos para el almacenamiento de blobs que contiene archivos de registro que se acceden frecuentemente durante 30 días, ocasionalmente durante 90 días y rara vez después de eso. ¿Qué TRES acciones de administración del ciclo de vida debe configurar?"
    },
    "explanation": {
      "en": "Moving to Cool tier after 30 days, then to Archive after 90 days, and deleting after retention period optimizes costs while meeting access patterns.",
      "es": "Mover al nivel Cool después de 30 días, luego a Archive después de 90 días, y eliminar después del período de retención optimiza los costos mientras cumple con los patrones de acceso."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Move to Cool tier after 30 days",
          "es": "Mover al nivel Cool después de 30 días"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Move to Archive tier after 90 days",
          "es": "Mover al nivel Archive después de 90 días"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Delete blobs older than 365 days",
          "es": "Eliminar blobs de más de 365 días"
        },
        "isCorrect": true
      },
      {
        "label": "D",
        "text": {
          "en": "Move to Hot tier after 60 days",
          "es": "Mover al nivel Hot después de 60 días"
        },
        "isCorrect": false
      },
      {
        "label": "E",
        "text": {
          "en": "Enable blob versioning",
          "es": "Habilitar control de versiones de blobs"
        },
        "isCorrect": false
      }
    ],
    "tags": ["storage", "lifecycle", "cost-optimization"]
  },
  {
    "domain": "STORAGE",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to secure access to a storage account so that only resources within a specific VNet can access it. What should you configure?",
      "es": "Necesita asegurar el acceso a una cuenta de almacenamiento para que solo los recursos dentro de una VNet específica puedan acceder a ella. ¿Qué debe configurar?"
    },
    "explanation": {
      "en": "Storage account firewall and virtual network rules restrict access to specific VNets and subnets.",
      "es": "Las reglas de firewall y red virtual de la cuenta de almacenamiento restringen el acceso a VNet y subredes específicas."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Storage account firewall and virtual network rules",
          "es": "Reglas de firewall y red virtual de la cuenta de almacenamiento"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Network Security Group rules",
          "es": "Reglas de Grupo de Seguridad de Red"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Azure Firewall",
          "es": "Azure Firewall"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Private DNS Zone",
          "es": "Zona DNS Privada"
        },
        "isCorrect": false
      }
    ],
    "tags": ["storage", "network-security", "vnet"]
  },
  {
    "domain": "STORAGE",
    "difficulty": "EASY",
    "qtype": "YESNO",
    "stem": {
      "en": "Can you change the replication type of an existing storage account from LRS to GRS without data loss?",
      "es": "¿Puede cambiar el tipo de replicación de una cuenta de almacenamiento existente de LRS a GRS sin pérdida de datos?"
    },
    "explanation": {
      "en": "Yes, you can change the replication setting of an existing storage account, and Azure will replicate your data to the new configuration without data loss.",
      "es": "Sí, puede cambiar la configuración de replicación de una cuenta de almacenamiento existente, y Azure replicará sus datos a la nueva configuración sin pérdida de datos."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Yes",
          "es": "Sí"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "No",
          "es": "No"
        },
        "isCorrect": false
      }
    ],
    "tags": ["storage", "replication", "migration"]
  },
  {
    "domain": "MONITOR_MAINTAIN",
    "difficulty": "EASY",
    "qtype": "SINGLE",
    "stem": {
      "en": "Which Azure service should you use to collect and analyze telemetry data from Azure resources?",
      "es": "¿Qué servicio de Azure debe usar para recopilar y analizar datos de telemetría de recursos de Azure?"
    },
    "explanation": {
      "en": "Azure Monitor is the centralized service for collecting, analyzing, and acting on telemetry from cloud and on-premises environments.",
      "es": "Azure Monitor es el servicio centralizado para recopilar, analizar y actuar sobre la telemetría de entornos en la nube y locales."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Azure Monitor",
          "es": "Azure Monitor"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Azure Advisor",
          "es": "Azure Advisor"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Azure Security Center",
          "es": "Azure Security Center"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Azure Service Health",
          "es": "Azure Service Health"
        },
        "isCorrect": false
      }
    ],
    "tags": ["monitor", "telemetry", "logging"]
  },
  {
    "domain": "MONITOR_MAINTAIN",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to create an alert when CPU usage exceeds 80% for more than 5 minutes. Which metric alert condition should you use?",
      "es": "Necesita crear una alerta cuando el uso de CPU supere el 80% durante más de 5 minutos. ¿Qué condición de alerta de métrica debe usar?"
    },
    "explanation": {
      "en": "A metric alert rule with static threshold 'Greater than 80' and aggregation period of 5 minutes ensures the alert fires only when the condition persists.",
      "es": "Una regla de alerta de métrica con umbral estático 'Mayor que 80' y período de agregación de 5 minutos garantiza que la alerta se active solo cuando la condición persiste."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Static threshold with 'Greater than 80' and evaluation period of 5 minutes",
          "es": "Umbral estático con 'Mayor que 80' y período de evaluación de 5 minutos"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Dynamic threshold with high sensitivity",
          "es": "Umbral dinámico con alta sensibilidad"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Log query alert with 5-minute frequency",
          "es": "Alerta de consulta de registro con frecuencia de 5 minutos"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Activity log alert",
          "es": "Alerta de registro de actividad"
        },
        "isCorrect": false
      }
    ],
    "tags": ["monitor", "alerts", "metrics"]
  },
  {
    "domain": "MONITOR_MAINTAIN",
    "difficulty": "HARD",
    "qtype": "MULTI",
    "stem": {
      "en": "You need to implement a backup solution for Azure VMs that includes daily backups with 30-day retention and monthly backups with 12-month retention. Which THREE actions should you perform?",
      "es": "Necesita implementar una solución de copia de seguridad para VM de Azure que incluya copias de seguridad diarias con retención de 30 días y copias de seguridad mensuales con retención de 12 meses. ¿Qué TRES acciones debe realizar?"
    },
    "explanation": {
      "en": "Recovery Services Vault stores backups, backup policy defines schedules and retention, and enabling backup on VMs applies the policy.",
      "es": "El almacén de Recovery Services almacena las copias de seguridad, la política de copia de seguridad define los horarios y la retención, y habilitar la copia de seguridad en las VM aplica la política."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Create a Recovery Services vault",
          "es": "Crear un almacén de Recovery Services"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Configure a backup policy with daily and monthly schedules",
          "es": "Configurar una política de copia de seguridad con programaciones diarias y mensuales"
        },
        "isCorrect": true
      },
      {
        "label": "C",
        "text": {
          "en": "Enable Azure Backup on the VMs",
          "es": "Habilitar Azure Backup en las VM"
        },
        "isCorrect": true
      },
      {
        "label": "D",
        "text": {
          "en": "Configure Azure Site Recovery",
          "es": "Configurar Azure Site Recovery"
        },
        "isCorrect": false
      },
      {
        "label": "E",
        "text": {
          "en": "Create VM snapshots manually",
          "es": "Crear instantáneas de VM manualmente"
        },
        "isCorrect": false
      }
    ],
    "tags": ["backup", "recovery-services", "retention"]
  },
  {
    "domain": "MONITOR_MAINTAIN",
    "difficulty": "MEDIUM",
    "qtype": "SINGLE",
    "stem": {
      "en": "You need to analyze VM performance issues using custom queries. Which Azure Monitor feature should you use?",
      "es": "Necesita analizar problemas de rendimiento de VM utilizando consultas personalizadas. ¿Qué característica de Azure Monitor debe usar?"
    },
    "explanation": {
      "en": "Log Analytics workspace allows you to run KQL queries on collected logs and metrics for advanced analysis and troubleshooting.",
      "es": "El área de trabajo de Log Analytics le permite ejecutar consultas KQL en registros y métricas recopilados para análisis avanzado y solución de problemas."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Log Analytics workspace with KQL queries",
          "es": "Área de trabajo de Log Analytics con consultas KQL"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "Metrics Explorer",
          "es": "Explorador de métricas"
        },
        "isCorrect": false
      },
      {
        "label": "C",
        "text": {
          "en": "Activity Log",
          "es": "Registro de actividad"
        },
        "isCorrect": false
      },
      {
        "label": "D",
        "text": {
          "en": "Service Health",
          "es": "Estado del servicio"
        },
        "isCorrect": false
      }
    ],
    "tags": ["log-analytics", "monitoring", "kql"]
  },
  {
    "domain": "MONITOR_MAINTAIN",
    "difficulty": "EASY",
    "qtype": "YESNO",
    "stem": {
      "en": "Can you use Azure Monitor to monitor on-premises resources in addition to Azure resources?",
      "es": "¿Puede usar Azure Monitor para monitorear recursos locales además de recursos de Azure?"
    },
    "explanation": {
      "en": "Yes, Azure Monitor can collect data from on-premises resources using agents like the Azure Monitor agent or Log Analytics agent.",
      "es": "Sí, Azure Monitor puede recopilar datos de recursos locales utilizando agentes como el agente de Azure Monitor o el agente de Log Analytics."
    },
    "options": [
      {
        "label": "A",
        "text": {
          "en": "Yes",
          "es": "Sí"
        },
        "isCorrect": true
      },
      {
        "label": "B",
        "text": {
          "en": "No",
          "es": "No"
        },
        "isCorrect": false
      }
    ],
    "tags": ["monitor", "hybrid", "agents"]
  }
]

